app/views/messages/create.json.jbuilder

json.image  @message.image.url
json.created_at  @message.created_at.strftime("%Y/%m/%d %H:%M")
---
INSERT INTO `messages` (`text`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', 'icon.jpg', 18, 1, '2019-05-14 04:26:03', '2019-05-14 04:26:03')