app/views/messages/index.html.haml

              %li.member-list__member
                - @group.users.each do |user|
---
SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 11