app/controllers/api/messages_controller.rb

  def index
    @group = Group.find(params[:group_id])
    respond_to do |format|
      format.html
      format.json { @new_messages = @group.messages.where('id > ?', params[:id]) }
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 66 LIMIT 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`group_id` = 66 AND (id > '4571')