app/controllers/groups_controller.rb

INSERT INTO `group_users` (`user_id`, `created_at`, `updated_at`) VALUES (1, '2019-05-07 07:49:56', '2019-05-07 07:49:56')
INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('a', '2019-05-07 07:23:08', '2019-05-07 07:23:08')
---
  def create
    @group = Group.new(create_params)
    @group.users << current_user

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = NULL LIMIT 1
---
  def set_group
    @group = Group.find(params[:id])