app/controllers/messages_controller.rb

  def index
    @message = Message.new
    @messages = @group.messages.includes(:user)
---
SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 9 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 11

  def create
    @message = @group.messages.new(message_params)
    if @message.save
      redirect_to group_messages_path(@group), notice: "メッセージが送信されました"
    else
      @messages = @group.messages.includes(:user)
---
INSERT INTO `messages` (`text`, `group_id`, `user_id`, `created_at`, `updated_at`, `image`) VALUES ('うえる ぶっきょう げんめつ 半額。', 59, 40, '2019-05-11 20:07:27', '2019-05-11 20:07:27', NULL)
SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 9 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 9

  def set_group
    @group = Group.find(params[:group_id])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = NULL LIMIT 1