app/controllers/users_controller.rb

  def index
    @users = User.where('name LIKE(?)', "%#{params[:keyword]}%").where.not(id:
      current_user)
---
SELECT `users`.* FROM `users` WHERE (name LIKE('%w%'))

  def update
    if current_user.update(user_params)
---
UPDATE `users` SET `name` = '', `updated_at` = '2019-05-07 01:06:42' WHERE `users`.`id` = 1